xbenkozx/RAZ-RE/Firmware/keil-mdk/firmware/n32g031_std_periph_driver/src/n32g031_adc.c
    tmpregister &= (~ADC_CTRL3_CKMOD_MSK);
    if(ADC_InitStructEx->ClkMode==ADC_CTRL3_CKMOD_PLL)
    tmpregister |= ADC_CTRL3_CKMOD_MSK;

    ADCx->CTRL3 = tmpregister;
}
/**
 * @brief  Checks whether the specified ADC flag is set or not.
 * @param ADCx = ADC, to select the ADC peripheral.
 * @param ADC_FLAG_NEW specifies the flag to check.
 *   This parameter can be one of the following values:
 *     @arg ADC_FLAG_RDY     ADC ready flag
 *     @arg ADC_FLAG_PD_RDY  ADC powerdown ready flag
 * @return The new state of ADC_FLAG_NEW (SET or RESET).
 */
FlagStatus ADC_GetFlagStatusNew(ADC_Module* ADCx, uint8_t ADC_FLAG_NEW)
{
    FlagStatus bitstatus = RESET;
    /* Check the parameters */
    assert_param(IsAdcModule(ADCx));
    assert_param(IsAdcGetFlag(ADC_FLAG_NEW));
    /* Check the status of the specified ADC flag */
    if ((ADCx->CTRL3 & ADC_FLAG_NEW) != (uint8_t)RESET)
    {
        /* ADC_FLAG_NEW is set */
        bitstatus = SET;
    }
    else
    {
        /* ADC_FLAG_NEW is reset */
        bitstatus = RESET;
    }
    /* Return the ADC_FLAG_NEW status */
    return bitstatus;
}

/**
 * @brief  Configures the ADCHCLK prescaler.
 * @param RCC_ADCHCLKPrescaler specifies the ADCHCLK prescaler.
 *   This parameter can be on of the following values:
 *     @arg RCC_ADCHCLK_DIV1 ADCHCLKPRE[3:0] = 0000, HCLK Clock Divided By 1
 *     @arg RCC_ADCHCLK_DIV2 ADCHCLKPRE[3:0] = 0001, HCLK Clock Divided By 2
 *     @arg RCC_ADCHCLK_DIV3 ADCHCLKPRE[3:0] = 0010, HCLK Clock Divided By 3
 *     @arg RCC_ADCHCLK_DIV4 ADCHCLKPRE[3:0] = 0011, HCLK Clock Divided By 4
 *     @arg RCC_ADCHCLK_DIV6 ADCHCLKPRE[3:0] = 0100, HCLK Clock Divided By 6
 *     @arg RCC_ADCHCLK_DIV8 ADCHCLKPRE[3:0] = 0101, HCLK Clock Divided By 8
 *     @arg RCC_ADCHCLK_DIV10 ADCHCLKPRE[3:0] = 0110, HCLK Clock Divided By 10
 *     @arg RCC_ADCHCLK_DIV12 ADCHCLKPRE[3:0] = 0111, HCLK Clock Divided By 12
 *     @arg RCC_ADCHCLK_DIV16 ADCHCLKPRE[3:0] = 1000, HCLK Clock Divided By 16
 *     @arg RCC_ADCHCLK_DIV32 ADCHCLKPRE[3:0] = 1001, HCLK Clock Divided By 32
 *     @arg RCC_ADCHCLK_DIV_OTHERS ADCHCLKPRE[3:0] = others, HCLK Clock Divided By 32

 *     @arg RCC_ADCPLLCLK_DISABLE ADCPLLCLKPRES[4:0] = 0xxxx, ADC Pll Clock Disable
 *     @arg RCC_ADCPLLCLK_DIV1 ADCPLLCLKPRES[4:0] = 10000, Pll Clock Divided By 1
 *     @arg RCC_ADCPLLCLK_DIV2 ADCPLLCLKPRES[4:0] = 10001, Pll Clock Divided By 2
 *     @arg RCC_ADCPLLCLK_DIV3 ADCPLLCLKPRES[4:0] = 10010, Pll Clock Divided By 3
 *     @arg RCC_ADCPLLCLK_DIV4 ADCPLLCLKPRES[4:0] = 10011, Pll Clock Divided By 4
 *     @arg RCC_ADCPLLCLK_DIV6 ADCPLLCLKPRES[4:0] = 10100, Pll Clock Divided By 6
 *     @arg RCC_ADCPLLCLK_DIV8 ADCPLLCLKPRES[4:0] = 10101, Pll Clock Divided By 8
 *     @arg RCC_ADCPLLCLK_DIV10 ADCPLLCLKPRES[4:0] = 10110, Pll Clock Divided By 10
 *     @arg RCC_ADCPLLCLK_DIV12 ADCPLLCLKPRES[4:0] = 10111, Pll Clock Divided By 12
 *     @arg RCC_ADCPLLCLK_DIV16 ADCPLLCLKPRES[4:0] = 11000, Pll Clock Divided By 16
 *     @arg RCC_ADCPLLCLK_DIV32 ADCPLLCLKPRES[4:0] = 11001, Pll Clock Divided By 32
 *     @arg RCC_ADCPLLCLK_DIV64 ADCPLLCLKPRES[4:0] = 11010, Pll Clock Divided By 64
 *     @arg RCC_ADCPLLCLK_DIV128 ADCPLLCLKPRES[4:0] = 11011, Pll Clock Divided By 128
 *     @arg RCC_ADCPLLCLK_DIV256 ADCPLLCLKPRES[4:0] = 11100, Pll Clock Divided By 256
 *     @arg RCC_ADCPLLCLK_DIV_OTHERS ADCPLLCLKPRES[4:0] = others, Pll Clock Divided By 256
 */
void ADC_ConfigClk(ADC_CTRL3_CKMOD ADC_ClkMode, uint32_t RCC_ADCHCLKPrescaler)
{
    if(ADC_ClkMode==ADC_CTRL3_CKMOD_AHB){
        RCC_ConfigAdcPllClk(RCC_ADCPLLCLK_DIV1, DISABLE);
        RCC_ConfigAdcHclk(RCC_ADCHCLKPrescaler);
        ADC_AHB_Clock_Mode_Config(ADC);		
    }else{
        RCC_ConfigAdcPllClk(RCC_ADCHCLKPrescaler, ENABLE);
        RCC_ConfigAdcHclk(RCC_ADCHCLK_DIV1);
		ADC_PLL_Clock_Mode_Config(ADC);
    }
}

/**
 * @brief  Configures for the selected OPA channel that ADC can be controled 
 *         and its corresponding rank in the sequencer and FunctionalState.
 * @param ADCx = ADC, to select the ADC peripheral.
 * @param ADC_Channel the ADC channel to configure.
 *   This parameter can be one of the following values:
 *     @arg ADC_OPAMP_CS_VPSEL_PF0  OPA PF0 selected
 *     @arg ADC_OPAMP_CS_VPSEL_PA0  OPA PA0 selected
 *     @arg ADC_OPAMP_CS_VPSEL_PA1  OPA PA1 selected
 *     @arg ADC_OPAMP_CS_VPSEL_PA4  OPA PA4 selected
 *     @arg ADC_OPAMP_CS_VPSEL_PA7  OPA PA7 selected
 *     @arg ADC_OPAMP_CS_VPSEL_PB0  OPA PB0 selected
 *     @arg ADC_OPAMP_CS_VPSEL_PB14 OPA PB14 selected
 * @param Rank The rank in the injected group sequencer. This parameter must be between 1 and 4.
 * @param Cmd  This parameter can be: ENABLE or DISABLE.
 */
void ADC_ConfigOPAControl(ADC_Module* ADCx, uint8_t ADC_OPAChannel, uint8_t Rank, FunctionalState Cmd)
{
    uint32_t tmpreg1 = 0, tmpreg2 = 0, tmpreg3 = 0, tmpreg4 = 0;
    /* Check the parameters */
    assert_param(IsAdcModule(ADCx));
    assert_param(IsAdcOpaChannelValid(ADC_OPAChannel));
    assert_param(IsAdcInjRankValid(Rank));
    assert_param(IS_FUNCTIONAL_STATE(Cmd));

    tmpreg1 = ADCx->JSEQ;
    /* Get INJ_LEN value: Number = INJ_LEN+1 */
    tmpreg3 = (tmpreg1 & JSEQ_INJ_LEN_SET) >> 20;    
    /* Calculate the mask to clear: ((Rank-1)+(4-INJ_LEN-1)) */
    tmpreg2 = JSQ_OPASEL << (3 * (uint8_t)((Rank + 3) - (tmpreg3 + 1)) + 4); 

    tmpreg1 = ADCx->OPACTRL;
    /* Clear the old JSQx_OPASEL bits for the selected rank */
    tmpreg1 &= ~tmpreg2;
    /* Set the JSQx_OPASEL bits for the selected rank */
    tmpreg2 = (uint32_t)ADC_OPAChannel << (3 * (uint8_t)((Rank + 3) - (tmpreg3 + 1)) + 4);
    /* Set the JSQx_OPASEL bits for the selected rank */
    tmpreg1 |= tmpreg2;
    /* Store the new register value */
    ADCx->OPACTRL = tmpreg1;

    /* Calculate the enable mask to clear: ((Rank-1)+(4-INJ_LEN-1)) */
    tmpreg4 = 1 << ((uint8_t)((Rank + 3) - (tmpreg3 + 1)));
    /* Clear the old JSQx_OPAEN bits for the selected rank */
    tmpreg1 &= ~tmpreg4;    
    
    /* Set the JSQx_OPAEN bits for the selected rank */
    tmpreg4 = (uint32_t)Cmd << ((uint8_t)((Rank + 3) - (tmpreg3 + 1)));

    /* Set the JSQx_OPAEN bits for the selected rank */
    tmpreg1 |= tmpreg4;  
    /* Store the new register value */
    ADCx->OPACTRL = tmpreg1;
}

/**
 * @brief  Configures the opa setup time
 * @param ADCx = ADC, to select the ADC peripheral.
 * @param ADC_OPASetUpTime The OPASetUpTime
 *   This parameter must be a number between 0 to 1023.
 */
void ADC_ConfigOPASetUpTime(ADC_Module* ADCx, uint16_t ADC_OPASetUpTime)
{
    uint32_t tmpreg1 = 0;
    uint32_t tmpreg2 = 0;
    /* Check the parameters */
    assert_param(IsAdcModule(ADCx));
    assert_param(IsAdcOpaSetUpTimeValid(ADC_OPASetUpTime));

    /* Get the old register value */
    tmpreg1 = ADCx->OPACTRL;
    /* Clear the old OPA setup time */
    tmpreg1 &= OPA_SETUP_TIEM_RESET;
    /* Set the opa setup time*/
    tmpreg2 = ADC_OPASetUpTime;
    tmpreg1 |= tmpreg2 << 16;
    /* Store the new register value */
    ADCx->OPACTRL = tmpreg1;
}

void ADC_SetOPACtrl(uint32_t value)
{
    ADC->OPACTRL=value;
}
uint32_t ADC_GetOPACtrl(void)
{
    return ADC->OPACTRL;
}

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */
